#### Terraform Format and Style 🖌 `failure`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details open><summary>Show Plan</summary>

```hcl
terraform
spectrocloud_cluster_profile.dev-gcp: Refreshing state... [id=6010610ae9febe3edbe4751f]
spectrocloud_cluster_profile.prod-gcp: Refreshing state... [id=6011089de9febeb60e08c2b6]
spectrocloud_cluster_profile.azure: Refreshing state... [id=6010610ae9febe3eda2c7612]
spectrocloud_cluster_profile.prodvmware: Refreshing state... [id=6010610ae9febe3ed7c7598b]
spectrocloud_cluster_profile.devvmware: Refreshing state... [id=6010610ae9febe3edef14b9a]
spectrocloud_cluster_profile.prodaws: Refreshing state... [id=60106109e9febe3ecf90a896]
spectrocloud_cluster_gcp.cluster: Refreshing state... [id=6011bdecef54a3912411f918]
spectrocloud_cluster_aws.cluster: Refreshing state... [id=6010610ae9febe3ee228d7ed]
spectrocloud_cluster_vsphere.prod-vmware-1: Refreshing state... [id=6010610ae9febe3eecb7a00f]
spectrocloud_cluster_vsphere.prod-vmware-2: Refreshing state... [id=6010ce30e9febe8bd05a9979]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # spectrocloud_cluster_azure.cluster will be created
  + resource "spectrocloud_cluster_azure" "cluster" {
      + cloud_account_id   = "600511e9319e5f50a979c092"
      + cloud_config_id    = (known after apply)
      + cluster_profile_id = "6010610ae9febe3eda2c7612"
      + id                 = (known after apply)
      + kubeconfig         = (known after apply)
      + name               = "az-picard-2"

      + cloud_config {
          + region          = "westus"
          + resource_group  = "picard-west-us"
          + ssh_key         = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDAUaBODDNpQxJJqXz/Q+afauM5EPFp4oDRrWzK/cGd92N+exkd+tEZdO7n3R+WAx0XTcPiVvfKctzekNS6f/ZMrFb5HAPvFJtnGNIE2sm+eryEnAH+Sc7ppZha3/MaSp/A2dm2IobYRvwl04sEi4w1K+I8Rtt+fBe3gV3wnP3E3yOiRx4G2XFC3T6x8MjdOkjO2v6fBluw1M1H2etp1m/n4D70UkeyVJyipcntz0ubHweU7yPNdNS3YkpExYIGhm97C4dyESHEw9PZVdLs1FBL6mW5Yb4qVbg5FkLljLFynh9jL8IAYal0pibAAH+Sk/Nd4865lVJ3lrm8nhBnjs1OEFA487rcxyInxJk/WwLEHvo88Ku9IlYq15Alr8N/JHHackV4kAH0yJNeLtwAysK2gI7Mb5uGnMTPrz73IZqXSxFqnU34Ow+vwu8fXBtXmHA5cUHyz0ARzpgx8A0e8L8SjdY/6dsFhSzGo7JoCElN7sEMo7iI4Wdo8CYdlT+OXizBf3pnM/wxRZclCeRDJpLtd6jl5swv7J5ocINEh1r3BllCyV8L7Xp5gw8IKT3ohz6rliGJwwlq/emqY52eB3wweTLRm30z3h3aQa3YeAR+2JgvWlrJ3YWsYYCLRhSQTfYmpgUkoZIcfB2xkZzp6cyooM0i5Obz313HsxwBHOmNrw== spectro@spectro
            EOT
          + subscription_id = "8710ff2b-e468-434a-9a84-e522999f6b81"
        }

      + machine_pool {
          + azs                     = []
          + control_plane           = false
          + control_plane_as_worker = false
          + count                   = 1
          + instance_type           = "Standard_D2_v3"
          + name                    = "worker-basic"
          + update_strategy         = "RollingUpdateScaleOut"

          + disk {
              + size_gb = (known after apply)
              + type    = (known after apply)
            }
        }
      + machine_pool {
          + azs                     = []
          + control_plane           = true
          + control_plane_as_worker = true
          + count                   = 1
          + instance_type           = "Standard_D2_v3"
          + name                    = "master-pool"
          + update_strategy         = "RollingUpdateScaleOut"

          + disk {
              + size_gb = 65
              + type    = "Standard_LRS"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>

*Pusher: @saamalik, Action: `pull_request`, Working Directory: `sandbox`, Workflow: `Terraform Plan`*